; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image3 - mode
	infrared0 - mode
	infrared4 - mode
	infrared1 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation3 - direction
	Star5 - direction
	Star1 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	Star4 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph2)
	(supports instrument2 image3)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(have_image Planet7 infrared4)
	(have_image Planet8 infrared0)
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 infrared4)
))

)

; plan
1. (turn_to satellite0 groundstation6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 star11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star11)
   goals met: 0 of 5
5. (take_image satellite0 star11 instrument1 infrared4)
   added: (have_image star11 infrared4)
   goals met: 1 of 5
6. (turn_to satellite0 planet7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet7)
   goals met: 1 of 5
7. (take_image satellite0 planet7 instrument1 infrared4)
   added: (have_image planet7 infrared4)
   goals met: 2 of 5
8. (turn_to satellite0 groundstation2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 5
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 5
10. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 5
11. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 2 of 5
12. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 5
13. (take_image satellite0 phenomenon10 instrument2 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 3 of 5
14. (turn_to satellite0 planet8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet8)
   goals met: 3 of 5
15. (take_image satellite0 planet8 instrument2 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 4 of 5
16. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 4 of 5
17. (take_image satellite0 planet9 instrument2 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 5 of 5
